# Задание 1.
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.

name = input("Введите Ваше имя: ")
password = input("Введите Ващ пародь: ")
age = int(input("Введите Ваш возраст: "))
print(f"Ваши данные для входа в аккаунт: "
      f"Ваше имя - {name}, "
      f"Ваш пароль - {password}, "
      f"Ваш возраст - {age}")
